{
  "navlinks": [
    {
      "name": "Accueil",
      "url": "home"
    },
    {
      "name": "Àpropos",
      "url": "about"
    },
    {
      "name": "Compétences",
      "url": "skills"
    },
    {
      "name": "Projets",
      "url": "projects"
    },
    {
      "name": "CV",
      "url": "resume"
    },
    {
      "name": "Contact",
      "url": "contact"
    }
  ],
  "titles": ["À propos de moi", "Mes compétences", "Mes projets", "Mon CV", "Mes informations"],
  "welcome": "Salut, je suis Raouf.",
  "description": "Et je suis un",
  "words": [
    "Ingénieur logiciel",
    "développeur web",
    "Diplômé en informatique visuel"
  ],
  "about": "Je suis un développeur Web full-stack avec plus de trois ans d'expérience dans la conception et la création d'applications Web réactives. Je maîtrise React.js et Tailwind CSS, avec une expérience backend utilisant Node.js et Express.js. De plus, j'ai une bonne connaissance de PHP et Next.js, ainsi que des compétences en UI et UX design.",
  "experience": [
    {
      "title": "Développeur web full-stack",
      "date": "mars 2024 - présent",
      "place": "Ronin Tek",
      "description": "En tant que développeur Web full-stack chez Ronin Tek, j'ai travaillé sur divers projets, notamment des marchés en ligne et des sites Web de portefeuille, gérant l'ensemble du cycle de vie du projet, de la conception au CI/CD. J'ai utilisé la pile MERN, le rendu côté serveur (SSR) et Docker pour la conteneurisation. Cette expérience a considérablement amélioré mes compétences techniques et ma passion pour le développement Web."
    },
    {
      "title": "Membre développeur",
      "date": "2021 - 2024",
      "place": "Micro club - Université des Sciences et Technologies Houari Boumediene",
      "description": "Dans mon rôle de développeur au sein du 'Micro Club', j'ai acquis une expérience précieuse en informatique et en développement Web. Un projet remarquable impliquait la création d'un site Web pour le hackathon 'MGV' en utilisant Next.js, Typescript et le mouvement d'encadrement. De plus, mon implication dans le club a amélioré mes compétences générales, notamment le travail d'équipe et la communication, grâce à la collaboration avec d'autres membres sur divers projets."
    },
    {
      "title": "Développeur web indépendant",
      "date": "2022 - 2023",
      "place": "Clients recherchés",
      "description": "Tout au long de mes aventures en freelance, j'ai eu la chance de travailler sur une variété de projets de développement web. Pendant ce temps, j'ai pris l'initiative d'apprendre et d'expérimenter de nouvelles technologies web pour suivre l'évolution constante -évolution des tendances dans le domaine. Ce voyage indépendant a été à la fois passionnant et enrichissant, m'aidant à développer mes compétences et à rester à jour dans le monde dynamique du développement Web."
    },
    {
      "title": "Participant développeur",
      "date": "2022 - présent",
      "place": "Hackathons - USTHB & ESI...",
      "description": "Participer à des hackathons en tant que développeur et concepteur Web a changé la donne. J'ai pu montrer mes compétences en matière de création de sites Web, de résolution de problèmes et de collaboration avec les autres. Travaillant sous pression, je me suis rapidement adapté, j'ai trouvé des idées créatives et une bonne communication avec mon équipe. En utilisant les dernières technologies, j'ai construit des expériences Web visuellement attrayantes et fonctionnelles. Les hackathons m'ont poussé à grandir, favorisant le travail d'équipe et une passion pour l'apprentissage constant dans mon domaine."
    }
  ],
  "education": [
    {
      "title": "Informatique visuel",
      "date": "2022 - 2024",
      "place": "Master - Université des Sciences et Technologies Houari Boumediene",
      "description": "Traitement d'images, apprentissage automatique, Conception et développement de jeux vidéo, Visualisation de grandes masses de données, Communication multimédia et compression d'images."
    },
    {
      "title": "Informatique",
      "date": "2019 - 2022",
      "place": "Licence - Université des Sciences et Technologies Houari Boumediene",
      "description": "Algorithmes, logique, langages de programmation (python, C, Java, JS,PHP), base de données (SQL), compilation, conception d'architectures et de systèmes, programmation orientée objet."
    }
  ]
}
